package p1클래스와객체;

public class P1객체 {
    //처음부터 너무 많은거 설명해서 그럼.. 모델링까지만 설명하자 객체와 모델링

    /*
     * 현실세계처럼 개발해볼수 없을까 =우리가 주변에서 사물을 인지하는 방식대로 프로그래밍할 수 있지 않겠는가?  => 객체 지향
        -세상에 존재하는 모든 것은 사물,즉 객체(object)이다.  실체가 있든 없든
        -각각의 사물은 고유하다
        -사물은 속성을 갖고 동작을 한다.

        사물을 분류해서 이해하는것이 인간이 생각하는 방식
        - 나, 민지, 하니 = 직립보행을 하며 말을 하는 존재 = 사람
        - 동물원에서 내가  본 검은색털+ 배쪽에 흰털 + 뒤뚱뒤뚱하는 동물 1,2,3은  = 펭귄

        사람=    클래스?객체?
        김민지 = 클래스 ? 객체?
        뽀로로=  클래스 ? 객체?
        펭귄=    클래스 ? 객체?

        사람은 몇살?  김민지는 몇살?
        객체만 속성을 갖는다. 실제 동작을 하는 것도 객체다.
        클래스는  객체들의 공통된 속성과 동작을 정의한 것일 뿐.
        이런식으로 현실세계의 객체들을 잘 생각해서 클래스를 정의하는것이 모델링.

        서점 소프트웨어를 만든다면 다음과 같은 클래스가 필요할 것이다.
        서점 - 선반(클래스) : 문앞의 선반, 안쪽에 있는 선반, 어린이용 선반1 등등..
               책(클래스) : 책1,책2,책3......
     */
    public static void main(String[] args) {
    }
}
